[
  {
    "case_number": "RP-2025-217372",
    "file_date": "06/06/2025",
    "document_type": "L/P",
    "names_grantor_grantee": "Grantor: | VENTANA LAKES COMMUNITY ASSOCIATION INC | Grantee: | MADISON ARLIEKA DANIELLE | Grantee: | MADISON CEDRICK LEROY",
    "legal_description": "Desc: | VENTANA LAKES EAST | Sec: | 5 | Lot: | 34 | Block: | 3",
    "property_address": "ove = aD? OO RE-2025-217972 06/06/2025 ER 25.00 NOTICE OF 11S PENDENS NOTICE IS HEREBY GIVEN that Cause No, 2025-33594, styled Ventana Lakes Community Association, Inc. v. Cedrick Leroy Madison and Arlieka Danielle Madison, was commenced in the 189\" Judicial District Court of Harris County, Texas, is now pending in such, theraction seeks to TexayArpalfy dettribed as: LOE.34¢ BLOCK 3, OF VENTANA LAKES EAST SEC 5, A SUBDIVISION IN HARRIS CQUNTY, TEXAS, ACCORDING TO THE MAP OR PLAT THEREOR-RECORDED IN FILM CODE NO. 692989 OF THE MAP RECORDS OF HARRIS COUNTY, TEXAS. ish and enforce a right in real property situated in Harris County, The action seeks foreclosure of Plainliff's lien on the above-referenced property in reference ‘a to unpaid maintenance assessmet ~~ reasonable attomey's fees, costs of court and interest thereon, all in accordance Wisi the De mn covering said property Dated: June 06, 2025 re) ‘Ventana Lakes: smmmunity Association, Inc."
  },
  {
    "case_number": "RP-2025-217300",
    "file_date": "06/06/2025",
    "document_type": "L/P",
    "names_grantor_grantee": "Grantor: | VENTANA LAKES COMMUNITY ASSOCIATION INC | Grantee: | CERNA MEYLAN | Grantee: | GUERRERO LUIS M",
    "legal_description": "Desc: | VENTANA LAKES EAST | Sec: | 8 | Lot: | 41 | Block: | 1",
    "property_address": ":\n\nLOT 41, BLOCK 1, OF VENTSNALAKES EAST SEC 8, A SUBDIVISION\n\nIN HARRIS COUNTY, TEXAS, ACCORDING TO THE MAP OR PLAT\nTHEREOF RECORDED IN FILM GODE NO, 692986 AND AMENDED IN\n\nFILM CODE NO, 695876, Of THE MAP RECORDS OF HARRIS COUNTY,\n\nTEXAS,\n\nThe action seeks foreclosure of Plaintiffgien on the above-referenced property in reference"
  },
  {
    "case_number": "RP-2025-217255",
    "file_date": "06/06/2025",
    "document_type": "L/P",
    "names_grantor_grantee": "Grantor: | VENTANA LAKES COMMUNITY ASSOCIATION INC | Grantee: | GONZALEZ ELISAMA",
    "legal_description": "Desc: | VENTANA LAKES | Sec: | 14 | Lot: | 2 | Block: | 3",
    "property_address": "ove = aD? OO RE-2025-217255 06/06/2025 ER 25.00 NOTICE OF LIS PENDENS NOTICE IS HEREBY GIVEN that Cause No. 2025-33019, styled Ventana Lakes munity Association, Inc. v. Elisama Gonzalez, was commenced in the 11\" Judicial District Cot M éort of Haris County, Texas, snow pending in such Court \\e seeks to establish and enforce a right in rel property situated in Hlarris Conaty, Texas fp 28. LORS BLOC, OF VENTANA LAKES SEC 14, A SUBDIVISION IN HARRIS, COUNTY, TEXAS, ACCORDING TO THE MAP OR PLAT THEREOR-RECORDED IN FILM CODE NO. 682302 OF THE MAP RECORDS OF HARRIS COUNTY, TEXAS. The action seeks 7 lien on the sbove-referenced property in reference to unpaid maintenance assessment ed. reasonable altorney's fees, costs of court and interest thereon, all ia. 4 us ‘the PiBelaration covering said property Dated: June 06, 2025 1 Lal isa Association, Inc. Chis ow Attomey for aintiffg, gy"
  },
  {
    "case_number": "RP-2025-217208",
    "file_date": "06/06/2025",
    "document_type": "L/P",
    "names_grantor_grantee": "Grantor: | VENTANA LAKES COMMUNITY ASSOCIATION INC | Grantee: | BLANCO FRANCISCO JOSE ARISMENDI | Grantee: | GARANTON DEBBIE ROSANA LAREZ",
    "legal_description": "Desc: | VENTANA LAKES EAST | Sec: | 7 | Lot: | 7 | Block: | 3",
    "property_address": "ove = aD? OO RE-2025-217208 06/06/2025 ER 29.00 NOTICE IS HEREBY GIVEN that Cause No, 2025-30904, styled Ventana Lakes Community Association, Inc. y. Francisco Jose Arismendi Blanco and Debbie Rosana Larez Garanten, was commenced in the Judicial District Court of Harris County, Texas, is now pending in such Court The action seeks to establish and enforce a right in real property situated in Harris County, Texas, legally described as: LOT 7, BLOCK 3, OF VENTANA LAKES EAST SEC 7, A SUBDIVISION IN HARRIS COUNTY, TEXAS, ACCORDING TO THE MAP OR PLAT THEREOF RECORDED IN FILM CODE NO. 692992 AND AMENDED IN FILM CODE NO. 695874 OF THE MAP RECORDS OF HARRIS COUNTY, TEXAS. The action seeks foreclosure of Plaintiff's lien on the above-referenced property in reference Ta “c afhable attorneyiS fees, UNE n ace Sh So vEsangisaid prope! Dated: June 06, 2025 2 ‘Ventana Lakes Community Association, Inc. a RP-2025:"
  },
  {
    "case_number": "RP-2025-217182",
    "file_date": "06/06/2025",
    "document_type": "L/P",
    "names_grantor_grantee": "Grantor: | MIRAMAR LAKE HOMEOWNERS ASSOCIATION INC | Grantee: | MARTIN MICHAEL",
    "legal_description": "Desc: | MIRAMAR LAKE | Sec: | 3 | Lot: | 57 | Block: | 2",
    "property_address": ":\n\nJot FitySeon 6), in Blast Foo) of Miramar Lake, Section 8, a subcsion in\n\nNo. 555018, ‘of the Map Recotis of Harris County, Teans and which property i\n15 22406 Miramar Cffst Drive, Tomball, TX 77375.\n\n‘"
  },
  {
    "case_number": "RP-2025-216992",
    "file_date": "06/06/2025",
    "document_type": "L/P",
    "names_grantor_grantee": "Grantor: | COURTYARD - WESTWAY HOMEOWNERS ASSOCIATION | Grantee: | JACOME RAUMIR",
    "legal_description": "Desc: | WESTWAY | Block: | 1 | Reserve: | B",
    "property_address": "06/06/2025 ER $29.00 E115 PENDENS THESTATE OF TEXAS 5s COUNTY OF HARRS § _MPNOTICE IS HEREBY GIVEN that Cause No. 202589077; Courtyrd - Weatoay Homemmers jo. Raurair Jaco; In the District Court of Harris County, Texas, 113th Judicial District, and is gaogin acho ‘ctiomgeeks to establish and enforce a right in real property situated in Hartis County, ddescithed ax Cac e @ 2,820 square foot tract of land known as: Lot 3, Block 1 of ‘COUR (AED HOMES, om wivecoredoubiiion Of Unrestricted Reserve \"B\", Block 2, stony ection, a subdivision situated In Harris County, Texas, recorded In Volume 206, Page 123 of the Mp Records of Haris County, Texas, tid recorded subi yestricled Reserve *B\", being more particularly described in the f Dard Restri Courtyart-Westiay Homeounters Association, recorded Jai File? Code No. 2257 to 126-14-2282 of the Official Public Records of Real” Property.of Harris County, Texas, said Lot 3 being more particularly described by metes-and bounds as fellows: COMMENCING at 2 5/8 Tach Tron tod find Tn the Nortt Hine ofthat certain tract of tand known as: Stanford Court at the calied Norchuxst corm of suid Block, snid North tine of Stanford Caurt bears North 02° 00' 30” West, a Of R06 feet, and a Yi inch Irom rad found at an Interior \"L* corner of the East tin@of's¢id Westway, Section 1, West, a distance of 14.29 feet and'Geyt Pe West, a distance of 11.00 feet; THENCE South 02\" 00° 30\" Ezst, tod rod found along said North line of Stanford Court, @ distance of 70,30 feet of that certain tract of County Clerk's File No, P-790284, same being the Nortinest corner and PLACE OF BEGINNING of the herein described Lot 3; THENGE North 87° 59' 30\" Eact, along the South Vine of said Lot 2, « distance of 28.20 feet toW building corner of comer of said"
  },
  {
    "case_number": "RP-2025-216507",
    "file_date": "06/06/2025",
    "document_type": "L/P",
    "names_grantor_grantee": "Grantor: | AFTON OAKS CIVIC CLUB INC | Grantee: | REEVE JAMES | Grantee: | REEVE MARIA",
    "legal_description": "Desc: | AFTON OAKS | Lot: | 4 | Block: | 16",
    "property_address": ":\nLot Four (4), in Block Sixteen (16) of Afton Oaks, 2 unin HariEolanty,\n‘Teaas, according to the map or plat thereof, recorded in Volume 48; Page St the Map\nRecords of Harris County, exe and which property is commonly kaigdn as 3615\nNetwcasie Drive, Fouston, TX 77027.\n\n‘"
  },
  {
    "case_number": "RP-2025-216187",
    "file_date": "06/05/2025",
    "document_type": "L/P",
    "names_grantor_grantee": "Grantor: | DUCKWORTH ZEINAB M | Grantee: | DUCKWORTH KHALED CHARLES",
    "legal_description": "Desc: | LEADER CROSSING | Sec: | 1 | Lot: | 10 | Block: | 3",
    "property_address": "oe = aD? OO RE-2025-216187 06/08/2025 ER $25.00 STATE OF TEXAS § COUNTY OF HARRIS 8 NOTICE OF LIS PENDENS Notice is given that on June 3, 2025 a lawsuit, styled: ZEINAB M DUCKWORTH Cndlord) V KHALED CHARLES DUCKWORTH AND ALL OCCUPANTS (Tenant), bearing number: 101668022 filed on June 5, 2025 at 1:24pm, which may affect the title to real property, ‘was commenced by Petitioner/Landloré, ZEINAB M DUCKWORTH, in the JUSTICE COURT PRECINCT 5 PLACE 1 HARRIS COUNTY, TEXAS. The purpose of the lawsuit is for ZEINAB M DUCKWORTH to evict KHALED CHARLES DUCK WORTH AND ALL OCCUPANTS A 1 property affected by this proceeding is: tee BLK 3 LEADER CROSSING SEC I 31 LEADER ivr p) 2276 Christopher McFe all Chris Meyer Law Firm om. if STATE OF TEXAS § COUNTY OF FORT BEND. §"
  },
  {
    "case_number": "RP-2025-216097",
    "file_date": "06/05/2025",
    "document_type": "L/P",
    "names_grantor_grantee": "Grantor: | RATCLIFF BRIA | Grantee: | EKRE OF TEXAS LLC",
    "legal_description": "Desc: | CRANE STREET WOODS | Sec: | 5 | Lot: | 118 | Block: | 5",
    "property_address": "oo =a? OO Sys -: Gn UNITED STATES DISTRICT COURT -~ SOUTHERN DISTRICT OF TEXAS HOUSTON DIVISION Teor? ot BRIA RATCLIFF, 5 Plaintiff, Pro Se 6 v § CIVIL ACTIGNNGC4:25-ev-02280 § EKRE OF TEXAS LLC, § Defendant § 5 § NOTICE OF LIS seo NOTICE IS HEREBY GIVEN that a lewsuit is peniingith je United States District Coust for the Southern District of Texas, Houston Divisiogy/in Civil Action No. 4:25-cv= we 02280, styled Bria Retciffv. EKRE of Texas.C7thg subject ofthe suit concerns AY allegations of fraudulent conveyance and wréiggfal se of real property. ‘The rea! property at issue i situated in Fights County, Tenas, and is more particularly described as follows, “sy Lot One Hundred and Bighteen (118), Fi Five'(5) of Crane Street Woods, Section (5) an addition in Haris County, Texas, acéerding te the map or plat thereof, recorded in { ‘Volume 21, page 49, of the Map Retords-of Harris County, Texas, being more commonly transferred to as 3401 Lebadie Sire Houston, Texas 77026 Property Address: 340] Lebadig Street Hanston, Texas 77026"
  },
  {
    "case_number": "RP-2025-216051",
    "file_date": "06/05/2025",
    "document_type": "L/P",
    "names_grantor_grantee": "Grantor: | NORTH BRIAR COMMUNITY ASSOCIATION INC | Grantee: | GILBERT VICKY ANN",
    "legal_description": "Desc: | COUNTRY VILLAGE | Sec: | 1 | Lot: | 19 | Block: | 1",
    "property_address": "‘THE STATE OF pe § § county of fat § NOTICE is GIVEN that Cause No, 20253922; North Briar Commeaity Association, Inc v. Vicky Ann Gilbert, was aay can ol District Cour of Haris County, Texas, and is now pending in such Gout, ‘The action seek A TRACT br LAND conTAINING 11,172 SQUARE FEET MORE OR LESS AND known as: LOT NINETPEN 19), IN BLOCK ONE. {1), OF COUNTRY VILLAGE, SECTION ont (1), CORRECTED PLAT, A SUBDIVISION IN HARRIS COUNTY, EXHIBIT \"A\" ATTACHED HERETO AND MADE A PART HEREOF FOR ALL ATRACTOPLAKD CONTAINS Ud SURAE Yn OF LAT), MES CLS, TUNNEL LAR SO Nora COA AG AVAIE G2 RABEAVE INA CORROOTD MAT GT ‘COURTHY VLA RNDHVION STENCH AGCURDNO TO SMA OR PLAT THGRDS MACOREED Ik VORAM 26, PACE AS CD HE MAP TCO, MARAIS CRETE, DCAd, AND HH, tod SCAR Le BN ‘ARIEL DAY MATE AORN ANTCL counancva Te BOOTIWESE Ci Cm HAR At As APORIMAETIONND CTY VLLACS, ‘SOHN ei” . ‘et entn ana a Beye AcNORT HET TO AS Nar ODD RR SK ee ey"
  }
]